# Задача 2. Недоделка
# Вы пришли на работу в компанию по разработке игр, целевая аудитория —
# дети и их родители. У предыдущего программиста было задание сделать две
# игры в одном приложении, чтобы пользователь мог выбирать одну из них.
# Однако программист, на место которого вы пришли, перед увольнением не
# успел выполнить эту задачу и оставил только небольшой шаблон проекта.
# Используя этот шаблон, реализуйте игры «Камень, ножницы, бумага» и «Угадай
# число».
# Правила игры «Камень, ножницы, бумага»: программа запрашивает у
# пользователя строку и выводит, победил он или проиграл. Камень бьёт
# ножницы, ножницы режут бумагу, бумага кроет камень.
# Правила игры «Угадай число»: программа запрашивает у пользователя число
# до тех пор, пока он не отгадает загаданное.

# import random


# def rock_paper_scissors():
#     user_input = int("Выбери: 1 - камень, 2 - бумага, 3 - ножницы")
#     comp = random.randint(1,3)
# #     if player == computer:
# #         print("Ничья!")
# # elif (player == 1 and computer == 2) or (player == 2 and
# # computer == 3) or (player == 3 and computer == 1):
# # print("Вы выиграли!")
# # elif (player == 1 and computer == 3) or (player == 2 and
# # computer == 1) or (player == 3 and computer == 2):
# # print("Вы проиграли!")
# # else:
# # print("Неверная команда. Попробуйте снова.")


# def guess_the_number():
# # Здесь будет игра «Угадай число»
# def mainMenu():
# # Здесь главное